#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_MonsterTruck_BigCockpit

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "ABP_MonsterTruck_BigCockpit_structs.hpp"
#include "UNION_classes.hpp"
#include "ControlRig_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_MonsterTruck_BigCockpit.ABP_MonsterTruck_BigCockpit_C
// 0x1040 (0x20D0 - 0x1090)
class UABP_MonsterTruck_BigCockpit_C final : public UMonsterTruckAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1090(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct ABP_MonsterTruck_BigCockpit::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;  // 0x1098(0x0010)(HasGetValueTypeHash)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x10A8(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x10B0(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x10B8(0x0020)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig_1;                        // 0x10D8(0x04D0)(ContainsInstancedReference)
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_11;                 // 0x15A8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_10;                 // 0x15D0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_9;                  // 0x15F8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_8;                  // 0x1620(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_7;                  // 0x1648(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_6;                  // 0x1670(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_5;                  // 0x1698(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4;                  // 0x16C0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0x16E8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x1710(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x1738(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x1760(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0x1788(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_6;                       // 0x17D0(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x17F0(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_5;                       // 0x1838(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x1858(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_4;                       // 0x18A0(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x18C0(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3;                       // 0x1908(0x0020)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_1;                  // 0x1928(0x0070)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x1998(0x0020)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer;                    // 0x19B8(0x0070)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x1A28(0x0020)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x1A48(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x1A68(0x00C8)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x1B30(0x0048)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig;                          // 0x1B78(0x04D0)(ContainsInstancedReference)
	bool                                          __CustomProperty_IsEnableWheelUpdate_9AE3DE6C4C0F9B47507D61BF6C6A7286; // 0x2048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2049[0x7];                                     // 0x2049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FRotator>                       __CustomProperty_WheelRot_9AE3DE6C4C0F9B47507D61BF6C6A7286; // 0x2050(0x0010)()
	bool                                          __CustomProperty_IsEnableWheelUpdate_06FBC3784E0313F8922CC2BB491DA074; // 0x2060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2061[0x7];                                     // 0x2061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                __CustomProperty_WheelPosRR_06FBC3784E0313F8922CC2BB491DA074; // 0x2068(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                __CustomProperty_WheelPosRL_06FBC3784E0313F8922CC2BB491DA074; // 0x2080(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                __CustomProperty_WheelPosFR_06FBC3784E0313F8922CC2BB491DA074; // 0x2098(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                __CustomProperty_WheelPosFL_06FBC3784E0313F8922CC2BB491DA074; // 0x20B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_MonsterTruck_BigCockpit_AnimGraphNode_BlendSpacePlayer_895E66C54859BC4041896C96757C5161();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_MonsterTruck_BigCockpit_AnimGraphNode_BlendSpacePlayer_F3DE4A9E4B371DBC17CCABA21FC097B2();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_MonsterTruck_BigCockpit_AnimGraphNode_ControlRig_06FBC3784E0313F8922CC2BB491DA074();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_MonsterTruck_BigCockpit_AnimGraphNode_TransitionResult_0A51A2404D612F7AFA7F618A6A782545();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_MonsterTruck_BigCockpit_AnimGraphNode_TransitionResult_0E85F1F64764465C1D6A6BBB07AA7D43();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_MonsterTruck_BigCockpit_AnimGraphNode_TransitionResult_15353DBE498EC5E1DA646582EE806C56();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_MonsterTruck_BigCockpit_AnimGraphNode_TransitionResult_164B468C410E84305546038257CB4F8C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_MonsterTruck_BigCockpit_AnimGraphNode_TransitionResult_3529DE0146E9D946F71C71B5A32EEE25();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_MonsterTruck_BigCockpit_AnimGraphNode_TransitionResult_3541981549BFB5D33947BC8ABAA11D2F();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_MonsterTruck_BigCockpit_AnimGraphNode_TransitionResult_614F9AA84DF3549535B05EB4C98E6859();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_MonsterTruck_BigCockpit_AnimGraphNode_TransitionResult_900CF6E54D308841A6ACBFA1E3B90AAC();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_MonsterTruck_BigCockpit_AnimGraphNode_TransitionResult_B854B0CC40419D397AEA568A5A56AEB4();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_MonsterTruck_BigCockpit_AnimGraphNode_TransitionResult_C8BCE08A4CB64735BCDBB3B5DF6FD265();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_MonsterTruck_BigCockpit_AnimGraphNode_TransitionResult_CF87B2B24FC4230228CF2BA6FF721134();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_MonsterTruck_BigCockpit_AnimGraphNode_TransitionResult_FAE3B9504A5EDF5D4EDA4497D74686A2();
	void ExecuteUbergraph_ABP_MonsterTruck_BigCockpit(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_MonsterTruck_BigCockpit_C">();
	}
	static class UABP_MonsterTruck_BigCockpit_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_MonsterTruck_BigCockpit_C>();
	}
};
static_assert(alignof(UABP_MonsterTruck_BigCockpit_C) == 0x000010, "Wrong alignment on UABP_MonsterTruck_BigCockpit_C");
static_assert(sizeof(UABP_MonsterTruck_BigCockpit_C) == 0x0020D0, "Wrong size on UABP_MonsterTruck_BigCockpit_C");
static_assert(offsetof(UABP_MonsterTruck_BigCockpit_C, UberGraphFrame) == 0x001090, "Member 'UABP_MonsterTruck_BigCockpit_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_MonsterTruck_BigCockpit_C, __AnimBlueprintMutables) == 0x001098, "Member 'UABP_MonsterTruck_BigCockpit_C::__AnimBlueprintMutables' has a wrong offset!");
static_assert(offsetof(UABP_MonsterTruck_BigCockpit_C, AnimBlueprintExtension_PropertyAccess) == 0x0010A8, "Member 'UABP_MonsterTruck_BigCockpit_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UABP_MonsterTruck_BigCockpit_C, AnimBlueprintExtension_Base) == 0x0010B0, "Member 'UABP_MonsterTruck_BigCockpit_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UABP_MonsterTruck_BigCockpit_C, AnimGraphNode_Root) == 0x0010B8, "Member 'UABP_MonsterTruck_BigCockpit_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_MonsterTruck_BigCockpit_C, AnimGraphNode_ControlRig_1) == 0x0010D8, "Member 'UABP_MonsterTruck_BigCockpit_C::AnimGraphNode_ControlRig_1' has a wrong offset!");
static_assert(offsetof(UABP_MonsterTruck_BigCockpit_C, AnimGraphNode_TransitionResult_11) == 0x0015A8, "Member 'UABP_MonsterTruck_BigCockpit_C::AnimGraphNode_TransitionResult_11' has a wrong offset!");
static_assert(offsetof(UABP_MonsterTruck_BigCockpit_C, AnimGraphNode_TransitionResult_10) == 0x0015D0, "Member 'UABP_MonsterTruck_BigCockpit_C::AnimGraphNode_TransitionResult_10' has a wrong offset!");
static_assert(offsetof(UABP_MonsterTruck_BigCockpit_C, AnimGraphNode_TransitionResult_9) == 0x0015F8, "Member 'UABP_MonsterTruck_BigCockpit_C::AnimGraphNode_TransitionResult_9' has a wrong offset!");
static_assert(offsetof(UABP_MonsterTruck_BigCockpit_C, AnimGraphNode_TransitionResult_8) == 0x001620, "Member 'UABP_MonsterTruck_BigCockpit_C::AnimGraphNode_TransitionResult_8' has a wrong offset!");
static_assert(offsetof(UABP_MonsterTruck_BigCockpit_C, AnimGraphNode_TransitionResult_7) == 0x001648, "Member 'UABP_MonsterTruck_BigCockpit_C::AnimGraphNode_TransitionResult_7' has a wrong offset!");
static_assert(offsetof(UABP_MonsterTruck_BigCockpit_C, AnimGraphNode_TransitionResult_6) == 0x001670, "Member 'UABP_MonsterTruck_BigCockpit_C::AnimGraphNode_TransitionResult_6' has a wrong offset!");
static_assert(offsetof(UABP_MonsterTruck_BigCockpit_C, AnimGraphNode_TransitionResult_5) == 0x001698, "Member 'UABP_MonsterTruck_BigCockpit_C::AnimGraphNode_TransitionResult_5' has a wrong offset!");
static_assert(offsetof(UABP_MonsterTruck_BigCockpit_C, AnimGraphNode_TransitionResult_4) == 0x0016C0, "Member 'UABP_MonsterTruck_BigCockpit_C::AnimGraphNode_TransitionResult_4' has a wrong offset!");
static_assert(offsetof(UABP_MonsterTruck_BigCockpit_C, AnimGraphNode_TransitionResult_3) == 0x0016E8, "Member 'UABP_MonsterTruck_BigCockpit_C::AnimGraphNode_TransitionResult_3' has a wrong offset!");
static_assert(offsetof(UABP_MonsterTruck_BigCockpit_C, AnimGraphNode_TransitionResult_2) == 0x001710, "Member 'UABP_MonsterTruck_BigCockpit_C::AnimGraphNode_TransitionResult_2' has a wrong offset!");
static_assert(offsetof(UABP_MonsterTruck_BigCockpit_C, AnimGraphNode_TransitionResult_1) == 0x001738, "Member 'UABP_MonsterTruck_BigCockpit_C::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(UABP_MonsterTruck_BigCockpit_C, AnimGraphNode_TransitionResult) == 0x001760, "Member 'UABP_MonsterTruck_BigCockpit_C::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(UABP_MonsterTruck_BigCockpit_C, AnimGraphNode_SequencePlayer_3) == 0x001788, "Member 'UABP_MonsterTruck_BigCockpit_C::AnimGraphNode_SequencePlayer_3' has a wrong offset!");
static_assert(offsetof(UABP_MonsterTruck_BigCockpit_C, AnimGraphNode_StateResult_6) == 0x0017D0, "Member 'UABP_MonsterTruck_BigCockpit_C::AnimGraphNode_StateResult_6' has a wrong offset!");
static_assert(offsetof(UABP_MonsterTruck_BigCockpit_C, AnimGraphNode_SequencePlayer_2) == 0x0017F0, "Member 'UABP_MonsterTruck_BigCockpit_C::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(UABP_MonsterTruck_BigCockpit_C, AnimGraphNode_StateResult_5) == 0x001838, "Member 'UABP_MonsterTruck_BigCockpit_C::AnimGraphNode_StateResult_5' has a wrong offset!");
static_assert(offsetof(UABP_MonsterTruck_BigCockpit_C, AnimGraphNode_SequencePlayer_1) == 0x001858, "Member 'UABP_MonsterTruck_BigCockpit_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UABP_MonsterTruck_BigCockpit_C, AnimGraphNode_StateResult_4) == 0x0018A0, "Member 'UABP_MonsterTruck_BigCockpit_C::AnimGraphNode_StateResult_4' has a wrong offset!");
static_assert(offsetof(UABP_MonsterTruck_BigCockpit_C, AnimGraphNode_SequencePlayer) == 0x0018C0, "Member 'UABP_MonsterTruck_BigCockpit_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UABP_MonsterTruck_BigCockpit_C, AnimGraphNode_StateResult_3) == 0x001908, "Member 'UABP_MonsterTruck_BigCockpit_C::AnimGraphNode_StateResult_3' has a wrong offset!");
static_assert(offsetof(UABP_MonsterTruck_BigCockpit_C, AnimGraphNode_BlendSpacePlayer_1) == 0x001928, "Member 'UABP_MonsterTruck_BigCockpit_C::AnimGraphNode_BlendSpacePlayer_1' has a wrong offset!");
static_assert(offsetof(UABP_MonsterTruck_BigCockpit_C, AnimGraphNode_StateResult_2) == 0x001998, "Member 'UABP_MonsterTruck_BigCockpit_C::AnimGraphNode_StateResult_2' has a wrong offset!");
static_assert(offsetof(UABP_MonsterTruck_BigCockpit_C, AnimGraphNode_BlendSpacePlayer) == 0x0019B8, "Member 'UABP_MonsterTruck_BigCockpit_C::AnimGraphNode_BlendSpacePlayer' has a wrong offset!");
static_assert(offsetof(UABP_MonsterTruck_BigCockpit_C, AnimGraphNode_StateResult_1) == 0x001A28, "Member 'UABP_MonsterTruck_BigCockpit_C::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(UABP_MonsterTruck_BigCockpit_C, AnimGraphNode_StateResult) == 0x001A48, "Member 'UABP_MonsterTruck_BigCockpit_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UABP_MonsterTruck_BigCockpit_C, AnimGraphNode_StateMachine) == 0x001A68, "Member 'UABP_MonsterTruck_BigCockpit_C::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(UABP_MonsterTruck_BigCockpit_C, AnimGraphNode_Slot) == 0x001B30, "Member 'UABP_MonsterTruck_BigCockpit_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(UABP_MonsterTruck_BigCockpit_C, AnimGraphNode_ControlRig) == 0x001B78, "Member 'UABP_MonsterTruck_BigCockpit_C::AnimGraphNode_ControlRig' has a wrong offset!");
static_assert(offsetof(UABP_MonsterTruck_BigCockpit_C, __CustomProperty_IsEnableWheelUpdate_9AE3DE6C4C0F9B47507D61BF6C6A7286) == 0x002048, "Member 'UABP_MonsterTruck_BigCockpit_C::__CustomProperty_IsEnableWheelUpdate_9AE3DE6C4C0F9B47507D61BF6C6A7286' has a wrong offset!");
static_assert(offsetof(UABP_MonsterTruck_BigCockpit_C, __CustomProperty_WheelRot_9AE3DE6C4C0F9B47507D61BF6C6A7286) == 0x002050, "Member 'UABP_MonsterTruck_BigCockpit_C::__CustomProperty_WheelRot_9AE3DE6C4C0F9B47507D61BF6C6A7286' has a wrong offset!");
static_assert(offsetof(UABP_MonsterTruck_BigCockpit_C, __CustomProperty_IsEnableWheelUpdate_06FBC3784E0313F8922CC2BB491DA074) == 0x002060, "Member 'UABP_MonsterTruck_BigCockpit_C::__CustomProperty_IsEnableWheelUpdate_06FBC3784E0313F8922CC2BB491DA074' has a wrong offset!");
static_assert(offsetof(UABP_MonsterTruck_BigCockpit_C, __CustomProperty_WheelPosRR_06FBC3784E0313F8922CC2BB491DA074) == 0x002068, "Member 'UABP_MonsterTruck_BigCockpit_C::__CustomProperty_WheelPosRR_06FBC3784E0313F8922CC2BB491DA074' has a wrong offset!");
static_assert(offsetof(UABP_MonsterTruck_BigCockpit_C, __CustomProperty_WheelPosRL_06FBC3784E0313F8922CC2BB491DA074) == 0x002080, "Member 'UABP_MonsterTruck_BigCockpit_C::__CustomProperty_WheelPosRL_06FBC3784E0313F8922CC2BB491DA074' has a wrong offset!");
static_assert(offsetof(UABP_MonsterTruck_BigCockpit_C, __CustomProperty_WheelPosFR_06FBC3784E0313F8922CC2BB491DA074) == 0x002098, "Member 'UABP_MonsterTruck_BigCockpit_C::__CustomProperty_WheelPosFR_06FBC3784E0313F8922CC2BB491DA074' has a wrong offset!");
static_assert(offsetof(UABP_MonsterTruck_BigCockpit_C, __CustomProperty_WheelPosFL_06FBC3784E0313F8922CC2BB491DA074) == 0x0020B0, "Member 'UABP_MonsterTruck_BigCockpit_C::__CustomProperty_WheelPosFL_06FBC3784E0313F8922CC2BB491DA074' has a wrong offset!");

}

