#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_MonsterTruck_SmallCockpit

#include "Basic.hpp"

#include "UNION_classes.hpp"
#include "Engine_structs.hpp"
#include "ControlRig_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "ABP_MonsterTruck_SmallCockpit_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_MonsterTruck_SmallCockpit.ABP_MonsterTruck_SmallCockpit_C
// 0x10B0 (0x2250 - 0x11A0)
class UABP_MonsterTruck_SmallCockpit_C final : public UMonsterTruckAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x11A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct ABP_MonsterTruck_SmallCockpit::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables; // 0x11A8(0x0018)(HasGetValueTypeHash)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x11C0(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x11C8(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x11D0(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_11;                 // 0x11F0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_10;                 // 0x1218(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_9;                  // 0x1240(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_8;                  // 0x1268(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_7;                  // 0x1290(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_6;                  // 0x12B8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_5;                  // 0x12E0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4;                  // 0x1308(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0x1330(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x1358(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x1380(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x13A8(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0x13D0(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_6;                       // 0x1418(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x1438(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_5;                       // 0x1480(0x0020)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_2;                  // 0x14A0(0x0070)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_4;                       // 0x1510(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x1530(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3;                       // 0x1578(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x1598(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x15E0(0x0020)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_1;                  // 0x1600(0x0070)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x1670(0x0020)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer;                    // 0x1690(0x0070)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x1700(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x1720(0x00C8)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig_1;                        // 0x17E8(0x04D0)(ContainsInstancedReference)
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x1CB8(0x0048)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig;                          // 0x1D00(0x04D0)(ContainsInstancedReference)
	bool                                          __CustomProperty_IsEnableWheelUpdate_CF2430BC4CF8A5C2CC7ABCB9B3EBD9BD; // 0x21D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21D1[0x7];                                     // 0x21D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FRotator>                       __CustomProperty_WheelRot_CF2430BC4CF8A5C2CC7ABCB9B3EBD9BD; // 0x21D8(0x0010)()
	bool                                          __CustomProperty_IsEnableWheelUpdate_7F785B4B4DDA1AD29E7EAC94026DA528; // 0x21E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21E9[0x7];                                     // 0x21E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                __CustomProperty_WheelPosRR_7F785B4B4DDA1AD29E7EAC94026DA528; // 0x21F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                __CustomProperty_WheelPosRL_7F785B4B4DDA1AD29E7EAC94026DA528; // 0x2208(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                __CustomProperty_WheelPosFR_7F785B4B4DDA1AD29E7EAC94026DA528; // 0x2220(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                __CustomProperty_WheelPosFL_7F785B4B4DDA1AD29E7EAC94026DA528; // 0x2238(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_MonsterTruck_SmallCockpit_AnimGraphNode_BlendSpacePlayer_26DB4060459C5A9FA519EEBE543D1E82();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_MonsterTruck_SmallCockpit_AnimGraphNode_BlendSpacePlayer_4602F422466B5DF47E68E185AD0488F7();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_MonsterTruck_SmallCockpit_AnimGraphNode_ControlRig_7F785B4B4DDA1AD29E7EAC94026DA528();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_MonsterTruck_SmallCockpit_AnimGraphNode_TransitionResult_07A26828494EEC4B2222DC8A07D252F1();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_MonsterTruck_SmallCockpit_AnimGraphNode_TransitionResult_1C8A7F98400D37421DF73F8D645ED7E0();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_MonsterTruck_SmallCockpit_AnimGraphNode_TransitionResult_1F5964A546F21E0BF4A3419F9B20934B();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_MonsterTruck_SmallCockpit_AnimGraphNode_TransitionResult_2F75ABA44C969CFFB31B579ABC3FF3E7();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_MonsterTruck_SmallCockpit_AnimGraphNode_TransitionResult_59F209744764E593C5C93986AB9714A3();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_MonsterTruck_SmallCockpit_AnimGraphNode_TransitionResult_651FFFB34BCC65A33BA694A208D1883A();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_MonsterTruck_SmallCockpit_AnimGraphNode_TransitionResult_68525560402F9EABE426038B728106C0();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_MonsterTruck_SmallCockpit_AnimGraphNode_TransitionResult_79A831FB4598FEAAB9EBC1B36383BEF7();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_MonsterTruck_SmallCockpit_AnimGraphNode_TransitionResult_7E2AB23B4622C5A93843309D0C42E2D3();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_MonsterTruck_SmallCockpit_AnimGraphNode_TransitionResult_89AA0C9742CE33BAB644889D072A0D68();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_MonsterTruck_SmallCockpit_AnimGraphNode_TransitionResult_A982F18B48E1CF6D44FD3899DF9D616B();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_MonsterTruck_SmallCockpit_AnimGraphNode_TransitionResult_B1D7467D48C77B7721C3E580C65CCF6E();
	void ExecuteUbergraph_ABP_MonsterTruck_SmallCockpit(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ABP_MonsterTruck_SmallCockpit_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ABP_MonsterTruck_SmallCockpit_C")
	}
	static class UABP_MonsterTruck_SmallCockpit_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_MonsterTruck_SmallCockpit_C>();
	}
};
DUMPER7_ASSERTS_UABP_MonsterTruck_SmallCockpit_C;

}

