#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ST_ColorPresetSelectPageItemData

#include "Basic.hpp"

#include "EColorPresetSelectPageItemType_structs.hpp"
#include "UNION_structs.hpp"
#include "UnionSystem_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct ST_ColorPresetSelectPageItemData.ST_ColorPresetSelectPageItemData
// 0x0058 (0x0058 - 0x0000)
struct FST_ColorPresetSelectPageItemData final
{
public:
	EColorPresetSelectPageItemType                Type_30_ADBC9E1E4BDA6ADF32CFA991DC89F4AA;          // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMachineColorPresetId                         ColorPresetId_27_87CD493B4E8F27A46AAC3DB178E4E3CC; // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMachineColorPresetType                       ColorPresetType_36_CE0F3FBC459DC3A32306E58874D6E7EF; // 0x0002(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Name_6_EEDCC8894F9967925F900E8018211235;           // 0x0008(0x0010)(Edit, BlueprintVisible)
	bool                                          bIsSelected_12_62AD398442AFE835409849A7DC2606B6;   // 0x0018(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsNew_13_5CFDE5A2494EF599D0706E8607A62F1E;        // 0x0019(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x2];                                       // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Color_0_19_EBF7DECE427B3A3DE4B0ADB72A68D2F6;       // 0x001C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Color_1_22_A7DB2FB549D8895EFB2C8894EFF23B3E;       // 0x002C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Color_2_23_A1DF37FA4DDE6437CB9CC19A59BA5FE1;       // 0x003C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             IconTexture_33_D478A85A43450684899CD5A6B0756E7E;   // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FST_ColorPresetSelectPageItemData;

}

