#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UNION

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "UNION_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "UnionSystem_structs.hpp"
#include "UnionSystem_classes.hpp"
#include "UnionUI_structs.hpp"
#include "UnionUI_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "UnionRun_structs.hpp"
#include "UnionRun_classes.hpp"
#include "UnionLib_structs.hpp"
#include "UnionLib_classes.hpp"
#include "SlateCore_structs.hpp"
#include "InputCore_structs.hpp"
#include "EnhancedInput_classes.hpp"


namespace SDK
{

// Class UNION.CommonMenuControllerKeyboard
// 0x0028 (0x0308 - 0x02E0)
class UCommonMenuControllerKeyboard : public UUserWidget
{
public:
	class UWidgetSwitcher*                        WidgetSwitcher;                                    // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	class UImage*                                 PAT_Key;                                           // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	class UMaterialInstanceDynamic*               PAT_Key_Material;                                  // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	class UUnionRichTextBlock*                    TXT_Key;                                           // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	class UMaterialInstanceDynamic*               PAT_Mouse_Material;                                // 0x0300(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)

public:
	void SetFKey(const struct FKey& InKey);
	void SetKeyNameText(const class FText& InText);
	void SetTextureParamIndex(int32 InTextureIndex);

	int32 GetMouseButtonIndex(const struct FKey& InKey) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CommonMenuControllerKeyboard")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CommonMenuControllerKeyboard")
	}
	static class UCommonMenuControllerKeyboard* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCommonMenuControllerKeyboard>();
	}
};
DUMPER7_ASSERTS_UCommonMenuControllerKeyboard;

// Class UNION.AddCharacterInfo
// 0x0020 (0x0300 - 0x02E0)
class UAddCharacterInfo : public UUserWidget
{
public:
	uint8                                         Pad_2E0[0x10];                                     // 0x02E0(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UUserWidget*>                    SubWidgetList;                                     // 0x02F0(0x0010)(BlueprintVisible, ExportObject, ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)

public:
	void ForceClose();
	void Open(EDriverId characterId);
	void SetLastCutTexture(class UTexture2D* Texture);
	void SetSubWidgetTexture(class UUserWidget* SubWidget, class UTexture2D* Texture);
	void SetText(const class FText& TopText, const class FText& BottomText, const class FText& NameText);
	void SetupCharacter(EDriverId characterId);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AddCharacterInfo")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AddCharacterInfo")
	}
	static class UAddCharacterInfo* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAddCharacterInfo>();
	}
};
DUMPER7_ASSERTS_UAddCharacterInfo;

// Class UNION.SceneInputKeyHandler
// 0x0020 (0x02B0 - 0x0290)
class ASceneInputKeyHandler final : public AActor
{
public:
	TMulticastInlineDelegate<void(const struct FKey& PressedKey)> OnKeyPressed;                      // 0x0290(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnMouseClicked;                                    // 0x02A0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

public:
	void HandleInputKey(const struct FKey& Key);
	void HandleMouseClick();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SceneInputKeyHandler")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SceneInputKeyHandler")
	}
	static class ASceneInputKeyHandler* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASceneInputKeyHandler>();
	}
};
DUMPER7_ASSERTS_ASceneInputKeyHandler;

// Class UNION.AdvertiseWidget
// 0x0008 (0x03E0 - 0x03D8)
class UAdvertiseWidget final : public UUnionUISceneBase
{
public:
	class UImage*                                 Controller_Info;                                   // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)

public:
	void AnimationIn();
	void AnimationOut();
	void FinishAdvertiseMovie();
	void InitialiseMovie(const int32 MovieListIndex);
	bool IsOfficialVersion();
	void PauseAllAdvAnimation();
	void SetStrapTexture(class UTexture2D* InStrapTexture);
	void SkipAdvertiseLogo();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AdvertiseWidget")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AdvertiseWidget")
	}
	static class UAdvertiseWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAdvertiseWidget>();
	}
};
DUMPER7_ASSERTS_UAdvertiseWidget;

// Class UNION.AnotherStageLotteryWheel
// 0x1540 (0x1568 - 0x0028)
class UAnotherStageLotteryWheel final : public UObject
{
public:
	uint8                                         Pad_28[0x1530];                                    // 0x0028(0x1530)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EStageId>                              IgnoreCourses;                                     // 0x1558(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)

public:
	void AddIgnoreStage(EStageId IgnoreCourse);
	void AddIgnoreStages(const TArray<EStageId>& IgnoreCourses_0);
	void GetLotteryResultsStageIds(TArray<EStageId>* OutStageIds);
	const TArray<struct FAnotherStageLotteryResult> Lot(bool bUseCache, bool bIsResult);
	void Reset(int32 InSeed);
	void Setup();
	void SetupManual(const struct FAnotherStageLotteryParameter& InParameter);
	void WriteLotteryResultToSettings();

	const TArray<struct FAnotherStageLotteryResult> GetLotteryResults() const;
	int32 GetSeed() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AnotherStageLotteryWheel")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AnotherStageLotteryWheel")
	}
	static class UAnotherStageLotteryWheel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnotherStageLotteryWheel>();
	}
};
DUMPER7_ASSERTS_UAnotherStageLotteryWheel;

// Class UNION.CheatMemoryProfile
// 0x0000 (0x0028 - 0x0028)
class UCheatMemoryProfile final : public UObject
{
public:
	void AutoMemoryProfileCourses(const class FString& platformTypeName, int32 startProfileStageIndex, int32 endProfileStageIndex);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CheatMemoryProfile")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CheatMemoryProfile")
	}
	static class UCheatMemoryProfile* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCheatMemoryProfile>();
	}
};
DUMPER7_ASSERTS_UCheatMemoryProfile;

// Class UNION.SkeletalMeshActorBudgeted
// 0x0000 (0x0310 - 0x0310)
class ASkeletalMeshActorBudgeted final : public ASkeletalMeshActor
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SkeletalMeshActorBudgeted")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SkeletalMeshActorBudgeted")
	}
	static class ASkeletalMeshActorBudgeted* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASkeletalMeshActorBudgeted>();
	}
};
DUMPER7_ASSERTS_ASkeletalMeshActorBudgeted;

// Class UNION.AppCharaOpenDataAccessor
// 0x0000 (0x0028 - 0x0028)
class UAppCharaOpenDataAccessor final : public UBlueprintFunctionLibrary
{
public:
	static void GetAppCharaOpenData(struct FAppCharaOpenData* OutData);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AppCharaOpenDataAccessor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AppCharaOpenDataAccessor")
	}
	static class UAppCharaOpenDataAccessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAppCharaOpenDataAccessor>();
	}
};
DUMPER7_ASSERTS_UAppCharaOpenDataAccessor;

// Class UNION.CommonNoticeSubsystem
// 0x0048 (0x0088 - 0x0040)
class UCommonNoticeSubsystem final : public UTickableWorldSubsystem
{
public:
	uint8                                         Pad_40[0x10];                                      // 0x0040(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UChallengeNoticeWindow*                 ChallengeWindow;                                   // 0x0050(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UStreamingInstallNotice*                StreamingInstallNotice;                            // 0x0058(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UUserWidget*                            FullScreenMouseClickWidget;                        // 0x0060(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)
	uint8                                         Pad_68[0x10];                                      // 0x0068(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UStreamingInstallNotice*                DeviceDisconnectedNotice;                          // 0x0078(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_80[0x8];                                       // 0x0080(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AddChallengeNotice(int32 ChallengeId, float Time);
	void OnDeviceConnectedEvent(bool IsConnected, int32 ControllerIndex);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CommonNoticeSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CommonNoticeSubsystem")
	}
	static class UCommonNoticeSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCommonNoticeSubsystem>();
	}
};
DUMPER7_ASSERTS_UCommonNoticeSubsystem;

// Class UNION.AppDataManageSubsystem
// 0x0AF0 (0x0B20 - 0x0030)
class UAppDataManageSubsystem final : public UGameInstanceSubsystem
{
public:
	uint8                                         Pad_30[0xA20];                                     // 0x0030(0x0A20)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUnionRaceResource                     RaceResource;                                      // 0x0A50(0x00B0)(NativeAccessSpecifierPrivate)
	uint8                                         Pad_B00[0x20];                                     // 0x0B00(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BeginDebugMode();
	void ConfirmNoticeStreamingInstall();
	void EndDebugMode();
	struct FAppCharaOpenData GetCharaOpenData();
	struct FDebugAppMenuData GetDebugAppMenuData();
	bool GetForceDisableLobbyKick();
	bool GetForceOpenCollabo();
	bool GetForceOpenFriendMatch();
	bool GetForceSkipCloseLobbyInvitationWindow();
	bool GetForceUpdateCustomRuleRaceCountMax();
	struct FAppGadgetCustomizeData GetGadgetCustomizeData();
	struct FAppMenuData GetMenuData();
	void GetOverrideDriverIds(TArray<int32>* OutDriverIds);
	struct FAppRaceConfigData GetRaceConfigData();
	struct FAppRaceCountManageData GetRaceCountManageData();
	struct FAppRaceResultData GetRaceResultData();
	struct FAppTournamentModeData GetTournamentModeData();
	bool IsAllResourcesLoaded();
	bool IsOpenFriendListInOfflineSequence();
	bool IsSafe2ndLapCourse();
	void LoadDebugSettings();
	void LoadResources();
	void OnMapLoadFinished(class UWorld* NewWorld);
	void SetCharaOpenData(const struct FAppCharaOpenData& InSrc);
	void SetDebugAppMenuData(const struct FDebugAppMenuData& InSrc);
	void SetDebugOnlineFillCom(bool flg);
	void SetDebugPlayerTeamRank(int32 NewRank);
	void SetEnableLobbyLeaveInReturnedFromRaceToLobby(bool InEnable);
	void SetForceDisableLobbyKick(bool InDisable);
	void SetForceOpenCollabo(bool InEnable);
	void SetForceOpenFriendMatch(bool InEnable);
	void SetForceSkipCloseLobbyInvitationWindow(bool InEnable);
	void SetForceUpdateCustomRuleRaceCountMax(bool InEnable);
	void SetGadgetCustomizeData(const struct FAppGadgetCustomizeData& InSrc);
	void SetIsSafe2ndLapCourse(bool bInSafe);
	void SetMenuData(const struct FAppMenuData& InSrc);
	void SetOpenFriendListInOfflineSequence(bool InEnable);
	void SetPrivateMatchMonkeyTestAllSet();
	void SetRaceConfigData(const struct FAppRaceConfigData& InSrc);
	void SetRaceResultData(const struct FAppRaceResultData& InSrc);
	void SpawnedNpcDefaultMeshNum();
	void StoreCurrentLevelObjectPtr();
	void UnloadResources();

	bool AnyEntryCheckSuspend() const;
	float DirectionalEffectDisplayDurationForHoldItem() const;
	int32 GetAuraType() const;
	TSoftObjectPtr<class UWorld> GetCurrentLevelObjectPtr() const;
	float GetDebugCameraFocusDistance() const;
	float GetDebugCameraFOV() const;
	int32 getDebugDLCId() const;
	struct FVector GetDebugHoverProfileCamera() const;
	struct FVector GetDebugHoverProfileTarget() const;
	struct FVector GetDebugProfileCamera() const;
	struct FVector GetDebugProfileTarget() const;
	int32 GetDebugWorldMatchType() const;
	float GetDriftNoStartActionPlayRate() const;
	int32 GetEntryCheckSuspendSec() const;
	const TArray<EHoldItemMeshType> GetHoldItemQualitiesNonPC() const;
	const TArray<EHoldItemMeshType> GetHoldItemQualitiesPC() const;
	int32 GetHornType() const;
	EVehicleEngineSoundType GetLocalPlayerEngineSoundType() const;
	EVehicleMeshType GetLocalPlayerModelType() const;
	EVehicleEngineSoundType GetNpcEngineSoundType() const;
	EVehicleMeshType GetNpcModelType() const;
	TSoftObjectPtr<class UWorld> GetPreviousLevelObjectPtr() const;
	int32 GetStampType() const;
	bool HasEntryCheckError(uint8 ErrorNo) const;
	bool HasEntryCheckSuspend(uint8 SuspendNo) const;
	bool HasRandomLegendIrregularRule() const;
	bool HasRandomLegendResultResponse_ForUICheck() const;
	bool IgnoreLegendCompeEndCheck() const;
	bool IsConfirmedNoticeStreamingInstall() const;
	bool IsDebugInteraction() const;
	bool IsDebugMode() const;
	bool IsDebugOnlineFillCom() const;
	bool IsDLCNoticeForceSet() const;
	bool IsDodonpaForceStart() const;
	bool IsEnableDebugWirelessSequence() const;
	bool IsEnableDirectionalEffectForHoldItem() const;
	bool IsEnableDriftNoStartAction() const;
	bool IsEnableEnterLobbyAlone() const;
	bool IsEnableFlowingWaterPP() const;
	bool IsEnableHiSpeedPP() const;
	bool IsEnableLegendOpen() const;
	bool IsEnableLobbyLeaveInReturnedFromRaceToLobby() const;
	bool IsEnableLocalPlayerSound() const;
	bool IsEnableLocalPlayerSurfaceSound() const;
	bool IsEnableNpcSound() const;
	bool IsEnableNpcSurfaceSound() const;
	bool IsEnableOnlineLobbySequenceDebugShowInfo() const;
	bool IsEnableOnlineRaceHost() const;
	bool IsEnableOptimizedMeshEffect() const;
	bool IsEnableOverrideDriverId() const;
	bool IsEnableRadialBlurPP() const;
	bool IsEnableSkipTitleLogin() const;
	bool IsEnableSpinDriftStateDebugPrint() const;
	bool IsFestaForceNotice() const;
	bool IsFestaForceOutside() const;
	bool IsFestaForceStart() const;
	bool IsForceSpawnNpcDefaultMesh() const;
	bool IsLegendDodonpaPlay() const;
	bool IsLegendForceNotice() const;
	bool IsLegendForceStart() const;
	bool IsLocalPlayerForceCOM(int32 InLocalPlayerIndex) const;
	bool IsSkipEntryCheck() const;
	bool IsSpawnLocalPlayerBodycutActor() const;
	bool IsSpawnLocalPlayerDriverActor() const;
	bool IsSpawnNpcBodycutActor() const;
	bool IsSpawnNpcDriverActor() const;
	bool IsVisibleLocalPlayerEffect() const;
	bool IsVisibleLocalPlayerGhostLoadEffect() const;
	bool IsVisibleLocalPlayerSurfaceEffect() const;
	bool IsVisibleLocalPlayerTireMark() const;
	bool IsVisibleNpcEffect() const;
	bool IsVisibleNpcGhostLoadEffect() const;
	bool IsVisibleNpcSurfaceEffect() const;
	bool IsVisibleNpcTireMark() const;
	bool IsVisiblePlayerNameAndNumber() const;
	bool IsWorldMatchAndFestaActive() const;
	bool UnLockWireless() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AppDataManageSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AppDataManageSubsystem")
	}
	static class UAppDataManageSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAppDataManageSubsystem>();
	}
};
DUMPER7_ASSERTS_UAppDataManageSubsystem;

// Class UNION.AppFriendUtilityLibrary
// 0x0000 (0x0028 - 0x0028)
class UAppFriendUtilityLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void ConvertLobbyIdStringForDisplay(class FString* OutLobbyIdForDisplay, const class FString& InTargetLobbyId);
	static void ConvertPlayerIdStringForDisplay(class FString* OutPlayerIdForDisplay, const class FString& InTargetPlayerId);
	static ECrossplayPlatform GetPlatformTypeByStringData(const class FString& InPlatformStr);
	static bool GetPlayerIconBgColorDataTableRow(const class UDataTable* InDatatable, const class FName& InRowName, struct FOnlineSettingPlayerIconBgColorDataTableRow* OutDataTableRow);
	static bool GetPlayerIconBgColorDataTableRowByColorId(const class UDataTable* InDatatable, int32 InColorId, struct FOnlineSettingPlayerIconBgColorDataTableRow* OutDataTableRow);
	static bool GetPlayerIconDataTableRow(const class UDataTable* InDatatable, const class FName& InRowName, struct FOnlineSettingPlayerIconDataTableRow* OutDataTableRow);
	static bool GetPlayerIconDataTableRowByIconId(const class UDataTable* InDatatable, int32 InIconId, struct FOnlineSettingPlayerIconDataTableRow* OutDataTableRow);
	static bool GetPlayerIconDataTableRowBySelectIndex(const class UDataTable* InDatatable, int32 InDisplayIndex, struct FOnlineSettingPlayerIconDataTableRow* OutDataTableRow);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AppFriendUtilityLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AppFriendUtilityLibrary")
	}
	static class UAppFriendUtilityLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAppFriendUtilityLibrary>();
	}
};
DUMPER7_ASSERTS_UAppFriendUtilityLibrary;

// Class UNION.SceneCaptureComponentEx
// 0x00B0 (0x0BA0 - 0x0AF0)
#pragma pack(push, 0x1)
class alignas(0x10) USceneCaptureComponentEx : public USceneCaptureComponent2D
{
public:
	uint8                                         Pad_AF0[0x78];                                     // 0x0AF0(0x0078)(Fixing Size After Last Property [ Dumper-7 ])
	class UMeshComponent*                         OwnerMeshComponent_;                               // 0x0B68(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	class UMaterialInstanceDynamic*               MaterialInstance_;                                 // 0x0B70(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	uint8                                         Pad_B78[0x20];                                     // 0x0B78(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SceneCaptureComponentEx")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SceneCaptureComponentEx")
	}
	static class USceneCaptureComponentEx* GetDefaultObj()
	{
		return GetDefaultObjImpl<USceneCaptureComponentEx>();
	}
};
#pragma pack(pop)
DUMPER7_ASSERTS_USceneCaptureComponentEx;

// Class UNION.AppMatchUtilityLibrary
// 0x0000 (0x0028 - 0x0028)
class UAppMatchUtilityLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void FillCOMUser(const class UObject* WorldContextObject, class ULobbyContextBase* LobbyContext);
	static struct FMCEventData GetMCEventData();
	static void SetupOnlinePeerRaceConfig(class UObject* WorldContextObject, class UCommonLobbyContext* LobbyContext);
	static void SetupOnlineUserRacerConfig(class UObject* WorldContextObject, int32 OnlineIndex, class UCommonLobbyMemberContext* MemberContext);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AppMatchUtilityLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AppMatchUtilityLibrary")
	}
	static class UAppMatchUtilityLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAppMatchUtilityLibrary>();
	}
};
DUMPER7_ASSERTS_UAppMatchUtilityLibrary;

// Class UNION.CheatPartyRace
// 0x0000 (0x0028 - 0x0028)
class UCheatPartyRace final : public UObject
{
public:
	void DebugRivalTeamSelect();
	void ResetAllRivalTeamEliminatedCount();
	void ResetAllRivalTeamWinCount();
	void ResetDuelMode();
	void ResetIrregularEventType();
	void ResetItemAppearanceType();
	void ResetLastCutinRivalTeamId();
	void ResetRivalTeamEliminatedCount(ERivalTeamId InTeamID);
	void ResetRivalTeamWinCount(ERivalTeamId InTeamID);
	void ResetSelectedRivalTeamId();
	void SetAllRivalTeamEliminatedCount(int32 Count);
	void SetAllRivalTeamWinCount(int32 InWinCount);
	void SetDuelMode();
	void SetIrregularEventType(EIrregularEventId ID);
	void SetItemAppearanceType(ERaceSettingItemAppearanceRule Rule);
	void SetRivalTeamAndWin(ERivalTeamId InTeamID, int32 InWinCount);
	void SetRivalTeamEliminatedCount(ERivalTeamId InTeamID, int32 InWinCount);
	void SetRivalTeamWinCount(ERivalTeamId InTeamID, int32 InWinCount);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CheatPartyRace")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CheatPartyRace")
	}
	static class UCheatPartyRace* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCheatPartyRace>();
	}
};
DUMPER7_ASSERTS_UCheatPartyRace;

// Class UNION.CommonUserWidget
// 0x0010 (0x02F0 - 0x02E0)
class UCommonUserWidget : public UUserWidget
{
public:
	class UUMGSequencePlayer*                     CurrentAnimPlayer;                                 // 0x02E0(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)
	uint8                                         Pad_2E8[0x8];                                      // 0x02E8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void PlayAnimationExBP(class UWidgetAnimation* Animation, class UWidgetAnimation* LoopAnimation);
	void PlayAnimationExBPWithFinished(class UWidgetAnimation* Animation, class UWidgetAnimation* LoopAnimation, const TDelegate<void(bool Aborted)>& OnFinished);
	void StopAnimationEx();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CommonUserWidget")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CommonUserWidget")
	}
	static class UCommonUserWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCommonUserWidget>();
	}
};
DUMPER7_ASSERTS_UCommonUserWidget;

// Class UNION.RaceEndMenuUserReportConfirmationWidget
// 0x0030 (0x0320 - 0x02F0)
class URaceEndMenuUserReportConfirmationWidget final : public UCommonUserWidget
{
public:
	class URaceEndMenuUserReportPlayerButtonWidget* _PlayerDisplay;                                  // 0x02F0(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)
	class URaceEndMenuUserReportTypeButtonWidget* _ReportTypeDisplay;                                // 0x02F8(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)
	class UUnionUIButtonStandard*                 _DecisionButton;                                   // 0x0300(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)
	uint8                                         Pad_308[0x10];                                     // 0x0308(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       Confirmation_InLoop;                               // 0x0318(0x0008)(BlueprintVisible, ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)

public:
	void OnButtonDecided(class UUnionUIButtonBaseCore* Button);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RaceEndMenuUserReportConfirmationWidget")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RaceEndMenuUserReportConfirmationWidget")
	}
	static class URaceEndMenuUserReportConfirmationWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<URaceEndMenuUserReportConfirmationWidget>();
	}
};
DUMPER7_ASSERTS_URaceEndMenuUserReportConfirmationWidget;

// Class UNION.AppMenuDataAccessor
// 0x0000 (0x0028 - 0x0028)
class UAppMenuDataAccessor final : public UBlueprintFunctionLibrary
{
public:
	static void AddMenuDataNormalRivalIds(const EDriverId AddDriverId);
	static void AddMenuDataPowerRivalIds(const EDriverId AddDriverId);
	static void ClearMenuDataNormalRivalIds();
	static void ClearMenuDataPowerRivalIds();
	static void GetAppMenuData(struct FAppMenuData* OutData);
	static bool GetEnableOnlinePlay();
	static bool GetExecuteAdvertiseOnce();
	static bool GetExecuteStorePopupAutoOnce();
	static bool GetExecuteStorePopupAutoRequest();
	static bool GetHintRequest(EHintId InHintId);
	static TArray<EHintId> GetHintRequestArray();
	static EGroupRaceRule GetLastPlayFestaRuleId();
	static ECommonRaceMenuContentId GetLastSelectedRaceMenu();
	static uint8 GetMenuDataBaseRivalLevel();
	static const EDriverId GetMenuDataLastChoiceDriverId();
	static uint8 GetMenuDataLastChoiceRivalLevel();
	static const ERivalType GetMenuDataLastChoiceRivalType();
	static TArray<EDriverId> GetMenuDataNormalRivalIds();
	static TArray<EDriverId> GetMenuDataPowerRivalIds();
	static uint8 GetNeedsDonpaTicketForRaceRetry();
	static bool GetNewFlagForMachineParts();
	static EEtceteraSequenceMainState GetNextEtceteraSequenceMainState();
	static TArray<EStageId> GetPrivateMatchCourseSwitchSetting();
	static struct FPartyRacePresetSetting GetPrivateMatchCustomRaceSetting();
	static struct FItemSwitchSetting GetPrivateMatchItemSwitchSetting();
	static struct FSoundHandle GetRacePauseMenuInSESoundHandle();
	static int32 GetRecentLegendCompeGradeRate();
	static int32 GetRecentLegendCompeRankNumber();
	static EGrandPrixEndingId GetReservedGrandPrixEnding();
	static EMenuSpeedClassId GetSelectedMenuSpeedClassId();
	static ETopMenuPlayMode GetSelectedTopMenuPlayMode();
	static ETitleVisualId GetTitleVisualId();
	static bool IsBackToTitle();
	static bool IsBackToTopMenu();
	static bool IsBetweenCharaMachine();
	static bool IsChangedSettingVoiceLanguage();
	static bool IsComeBackFromRace();
	static bool IsIncompleteCollaboGPDescriptionPopupViewed();
	static bool IsReservedGameModeSelectOfTopMenu();
	static bool IsReservedRaceparkCleardDodonpaEvent();
	static bool IsSubMenuOnlineMode();
	static bool IsTimeTrialSkipSelectClassOnetime();
	static bool IsTitleForce2ndVisual();
	static bool IsTryGetCompensation();
	static void RemoveMenuDataNormalRivalIds(const EDriverId RemoveDriverId);
	static void RemoveMenuDataPowerRivalIds(const EDriverId RemoveDriverId);
	static void ReserveGrandPrixEnding(EGrandPrixEndingId GrandPrixEndingId);
	static void SetAppMenuData(const struct FAppMenuData& NewData);
	static void SetBackToTitle(bool bBackToTitle);
	static void SetBackToTopMenu(bool bNewValue);
	static void SetBetweenCharaMachine(bool bNewValue);
	static void SetComeBackFromRace(bool bNewValue);
	static void SetExecuteAdvertiseOnce();
	static void SetExecuteStorePopupAutoOnce();
	static void SetExecuteStorePopupAutoRequest();
	static void SetHintRequest(EHintId InHintId, bool bInRequest);
	static void SetIncompleteCollaboGPDescriptionPopupViewed(bool Value);
	static void SetIsReservedGameModeSelectOfTopMenu(bool Reserve);
	static void SetLastPlayFestaRuleId(EGroupRaceRule InPlayFestaRuleId);
	static void SetLastSelectedRaceMenu(ECommonRaceMenuContentId InLastSelected);
	static void SetMenuDataBaseRivalLevel(uint8 Value);
	static void SetMenuDataLastChoiceDriverId(const EDriverId SetDriverId);
	static void SetMenuDataLastChoiceRivalLevel(uint8 Value);
	static void SetMenuDataLastChoiceRivalType(const ERivalType SetValue);
	static void SetMenuDataNormalRivalIds(const TArray<EDriverId>& SetDriverIds);
	static void SetMenuDataPowerRivalIds(const TArray<EDriverId>& SetDriverIds);
	static void SetNewFlagForMachineParts(bool bNewValue);
	static void SetNextEtceteraSequenceMainState(EEtceteraSequenceMainState EtceteraSequenceMainState);
	static void SetPrivateMatchCourseSwitchSetting(const TArray<EStageId>& StageIds);
	static void SetPrivateMatchCustomRaceSetting(const struct FPartyRacePresetSetting& InRaceSetting);
	static void SetPrivateMatchItemSwitchSetting(int32 InGroup, const struct FItemSwitchSettingSingle& InItemSwitchSetting);
	static void SetPrivateMatchItemSwitchSettingAll(const struct FItemSwitchSetting& InItemSwitchSetting);
	static void SetRacePauseMenuInSESoundHandle(const struct FSoundHandle& SoundHandle);
	static void SetReservedRaceparkCleardDodonpaEvent(bool Reserve);
	static void SetSelectedMenuSpeedClassId(EMenuSpeedClassId NewId, bool InOnlyRaceSpeedClass);
	static void SetSelectedTopMenuPlayMode(ETopMenuPlayMode InTopMenuPlayMode);
	static void SetSubMenuOnlineMode(bool bIsSubMenuOnlineMode);
	static void SetTimeTrialSkipSelectClassOnetime(bool Value);
	static void SetTitleForce2ndVisual(bool Force);
	static void SetTitleVisualId(ETitleVisualId TitleVisualId);
	static void SetTryGetCompensation(const bool bInFlag);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AppMenuDataAccessor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AppMenuDataAccessor")
	}
	static class UAppMenuDataAccessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAppMenuDataAccessor>();
	}
};
DUMPER7_ASSERTS_UAppMenuDataAccessor;

// Class UNION.CommonMenuHeaderMenu
// 0x0088 (0x0460 - 0x03D8)
class UCommonMenuHeaderMenu : public UUnionUISceneBase
{
public:
	TMulticastInlineDelegate<void(class FText SendUserName, EAppSupportedPlatform SendUserPlatform)> OnRecvNice; // 0x03D8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UObject* Object)> OnDecideStampBtn;                          // 0x03E8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UObject* Object)> OnRuleTimeTableClicked;                    // 0x03F8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	class UUnionUISceneBase*                      InfoScene;                                         // 0x0408(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	class UCommonMenuRuleTimeTableScene*          RuleTimeTableScene;                                // 0x0410(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	class UUnionUIButtonBase*                     EmoteWheelButton;                                  // 0x0418(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	class UUnionUIButtonBase*                     JukeBoxButton;                                     // 0x0420(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	TArray<class UUnionUIButtonBase*>             ButtonArr;                                         // 0x0428(0x0010)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, ContainsInstancedReference, Protected, UObjectWrapper, NativeAccessSpecifierProtected, TObjectPtr)
	class UUnionUISceneBase*                      UserInfoScene;                                     // 0x0438(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	class UCommonMenuSubNewsBtn*                  HeaderNewsBtn;                                     // 0x0440(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	class ULobbyMatchingUIState*                  MatchingStateScene;                                // 0x0448(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	class UUserWidget*                            TournamentEntryBtn;                                // 0x0450(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	EGameModeId                                   CurrentGameModeId;                                 // 0x0458(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_459[0x7];                                      // 0x0459(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AddToViewportHeader();
	ECrossplayPlatform GetConvertPlatform(EAppSupportedPlatform InAppSupportedPlatformId);
	ESlateVisibility GetVisibilityRuleTimeTableScene();
	void OnInitialize();
	void PlayButtonAnimationIdle(int32 ButtonIndex);
	void PlayButtonAnimationWait(int32 ButtonIndex);
	void PlayForceHeaderNoticeOutAnim();
	void RemoveFromViewportHeader();
	void SetHeaderUserData(const class FText& InUserName, int32 InHonorId, ECrossplayPlatform InPlatformId, int32 InWinCounts, ERateRank InRateRank, float InRankPercent, bool IsShowingLegendCompeIcon, ELegendCompeRateGrade LegendGrade, int32 InLegendRate);
	void SetRuleTimeTable(int32 InTimetableIndex, const struct FDateTime& InTime, const struct FRestoredRule& InCurrentRule, bool bIsEnd);
	void SetRuleTimeTableFiexed(EGroupRaceRule InFixedRule);
	void Setup();
	void SetVisibilityHeaderRightBtn(ESlateVisibility InVisibility);
	void SetVisibilityNewsBtn(ESlateVisibility InVisibility);
	void SetVisibilityRuleTimeOpenWidget(ESlateVisibility InVisibility);
	void SetVisibilityRuleTimeRankCalcWidget(ESlateVisibility InVisibility);
	void SetVisibilityRuleTimeTableButtonIcon(ESlateVisibility InVisibility);
	void SetVisibilityRuleTimeTableOverlay(bool bInIsVisible);
	void SetVisibilityRuleTimeTableScene(ESlateVisibility InVisibility);
	void SetVisibilityRuleWidget(ESlateVisibility InVisibility);
	void SetVisibilityTeamInfoScene(ESlateVisibility InVisibility);
	void SetVisibilityTournamentEntryBtn(ESlateVisibility InVisibility);
	void SetVisibilityUserInfoScene(ESlateVisibility InVisibility);
	void UpdateFestaTimeScheduleAndWidget();
	void UpdateFestaTimeTableVisible();
	void UpdateFestaWinCounts(int32 InWinCounts);
	void UpdateHonorTitle();
	void UpdateLegendCompeData(bool IsEnableDefaultRuleView);
	void UpdateVisibilityNewsBtn_NewIcon();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CommonMenuHeaderMenu")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CommonMenuHeaderMenu")
	}
	static class UCommonMenuHeaderMenu* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCommonMenuHeaderMenu>();
	}
};
DUMPER7_ASSERTS_UCommonMenuHeaderMenu;

// Class UNION.UnionAssetPreloaderSubsystem
// 0x0120 (0x0150 - 0x0030)
class UUnionAssetPreloaderSubsystem final : public UGameInstanceSubsystem
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UPreloadAssetData*>              BootPreloadAssetList;                              // 0x0038(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPublic, TObjectPtr)
	uint8                                         Pad_48[0x8];                                       // 0x0048(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FPrimaryAssetId>                LoadedMachinePartsAssetIds;                        // 0x0050(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<struct FPrimaryAssetId>                LoadedDriverAssetIds;                              // 0x0060(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_70[0xE0];                                      // 0x0070(0x00E0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool AddPreloadStageAssets2(const EStageId& StageId);
	void PreloadBootAssets();
	void PreLoadStageAssets();
	bool PreloadStageAssets2(const TArray<EStageId>& StageIds, bool bIsGatherLoad);
	void SetTextureStreamingEnabled(bool bEnabled);
	void UnloadAnStageAssets2(const EStageId& StageId);
	void UnloadBootAssets();
	int32 UnloadNotSelectedDriverAssets();
	int32 UnloadNotSelectedMachineEffectAssets();
	int32 UnloadNotSelectedMachinePartsAssets();
	void UnloadStageAssets();
	void UnloadStageAssets2();
	int32 WaitForResourceStreaming(float TimeLimit);

	bool IsEnableBootPreloadAsset() const;
	bool IsEnableMenuPreloadAsset() const;
	bool IsEnableUnloadDriverCuesheets() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("UnionAssetPreloaderSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UnionAssetPreloaderSubsystem")
	}
	static class UUnionAssetPreloaderSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUnionAssetPreloaderSubsystem>();
	}
};
DUMPER7_ASSERTS_UUnionAssetPreloaderSubsystem;

// Class UNION.AppNetComponent
// 0x01E8 (0x0288 - 0x00A0)
class UAppNetComponent : public UActorComponent
{
public:
	TMulticastInlineDelegate<void(bool ResultIsYes)> OnInviteWindowResult;                           // 0x00A0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnInviteConfirmWindowIn;                           // 0x00B0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(bool bResultYes)> OnInviteConfirmWindowOut;                        // 0x00C0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	class AProcessLobbyInvitationObject*          LobbyProcessObject;                                // 0x00D0(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	class ULobbyInvitationNoticeWidget*           LobbyInvitationNoticeWidgetPtr;                    // 0x00D8(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	struct FLobbyInvitationNoticeInfo             LobbyInvitationNoticeInfoStruct;                   // 0x00E0(0x0090)(Edit, BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	class ULobbyJoinInfo*                         InvitationInfo;                                    // 0x0170(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FLobbyId                               SearchLobbyId;                                     // 0x0178(0x0010)(Edit, BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	struct FLobbyId                               PlatformInviteReceivedLobbyId;                     // 0x0188(0x0010)(BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	class UUnionUIPopupWindowBase*                ErrorPopupWindowPtr;                               // 0x0198(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UUnionUIPopupWindowBase*                ReturnToTitleErrorPopupWindowPtr;                  // 0x01A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          IsPlatformDecide;                                  // 0x01A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1A9[0x7];                                      // 0x01A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<ELobbyNoticeErrorType, class FText>      ErrorTitleText;                                    // 0x01B0(0x0050)(Edit, BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	TMap<ELobbyNoticeErrorType, class FText>      ErrorMessageText;                                  // 0x0200(0x0050)(Edit, BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	class FText                                   WaitCheckTitle;                                    // 0x0250(0x0010)(Edit, BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	class FText                                   WaitCheckMessage;                                  // 0x0260(0x0010)(Edit, BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	class UObject*                                PrevRegisteredMenu;                                // 0x0270(0x0008)(ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UUnionUIPopupWindowBase*                WaitCheckPopup;                                    // 0x0278(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_280[0x8];                                      // 0x0280(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BindOnReceiveInvite();
	bool CheckCrossPlay(ECrossplayPlatform InLobbyPlatform, bool InAllowCrossPlay);
	void CheckInvitationAvailable(class ULobbyJoinInfo* InJoinLobbyInfo, bool* IsAvailable);
	void CreateErrorNoticePopupWindow(ELobbyNoticeErrorType ErrorType);
	void CreateReturnToTitleErrorPopup();
	void CreateWaitSearchWidget();
	void DeleteWaitSearchWidget();
	void DestroyErrorNoticePopupWindow();
	class USquadContext* GetSquadContext();
	void KickToAllClientMember(class ULobbyContextBase* InContext);
	void OnAcceptLobbyInvitation(class ULobbyJoinInfo* InJoinLobbyInfo);
	void OnBindInvitationNoticeWidget();
	void OnBindInvitationNoticeWidgetWhenNotAvailable();
	void OnCompleteQuitLobbyEvent();
	void OnErrorNoticePopupWindowClose(class UUnionUIButtonBase* Button, int32 PanelIndex, int32 ButtonIndex);
	void OnGenerateLobbyInviteNoticeWidget();
	void OnInitialize();
	void OnJoinLobbyByIdSearch(const struct FLobbyId& LobbyId);
	void OnLobbyOperationCompleteSimple(bool bSuccessful, const struct FLobbyOperationResult& Result);
	void OnPlatformAcceptLobbyInvitation();
	void OnQuitCurrentLobby();
	void OnReceiveInviteCallback(const struct FUniqueNetIdRepl& UserId, class ULobbyJoinInfo* Invite);
	void OnReceiveInviteWindowCallback(bool ResultIsYes);
	void OnReturnToTitleErrorPopupClose(class UUnionUIButtonBase* Button, int32 PanelIndex, int32 ButtonIndex);
	void OnSetupLobbyInvitationNoticeWidget();
	void OnUnbindInvitationNoticeWidget();
	void PFInviteCallback();
	void SendInvite();
	bool SendSessionInvite(class UCommonLobbyContext* LobbyContext, const class FString& PlatformUserId);
	void SetIsInRace(bool InRace);

	class UCommonLobbyContext* GetCurrentInviteLobbyContext() const;
	bool ShouldCreateSquad() const;
	bool ShouldSendSessionInvitePlatform() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AppNetComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AppNetComponent")
	}
	static class UAppNetComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAppNetComponent>();
	}
};
DUMPER7_ASSERTS_UAppNetComponent;

// Class UNION.RaceSequenceStateBase
// 0x0018 (0x0110 - 0x00F8)
class URaceSequenceStateBase : public UHierarchicalStateMachineStateComponent
{
public:
	ERaceSequenceState                            DefaultMenuState;                                  // 0x00F8(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARaceSequence*                          OwnerRaceSequence;                                 // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_108[0x8];                                      // 0x0108(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ClearTimeoutTimer();
	void OnTimeout();
	bool SetNextRaceSequenceState(ERaceSequenceState InState);
	bool StartTimeoutTimer(float TimeoutTime);

	class ARaceSequence* GetOwnerRaceSequence() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RaceSequenceStateBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RaceSequenceStateBase")
	}
	static class URaceSequenceStateBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<URaceSequenceStateBase>();
	}
};
DUMPER7_ASSERTS_URaceSequenceStateBase;

// Class UNION.RaceSequenceStateSendRaceEnd
// 0x0058 (0x0168 - 0x0110)
class URaceSequenceStateSendRaceEnd : public URaceSequenceStateBase
{
public:
	uint8                                         Pad_110[0x8];                                      // 0x0110(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FCommon_UserOrderData>          UserOrder;                                         // 0x0118(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<struct FCommon_UserOrderData>          UserOrderIncludeCom;                               // 0x0128(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	class FString                                 entryRaceId;                                       // 0x0138(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          IsHost;                                            // 0x0148(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          IsValidLobbyContext;                               // 0x0149(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bAlreadyCalledDisableTimeout;                      // 0x014A(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bIsEnableTimeoutCheck;                             // 0x014B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bClientTimeout;                                    // 0x014C(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_14D[0x3];                                      // 0x014D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ClientTimeoutTime;                                 // 0x0150(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         ElapsedTime;                                       // 0x0154(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_158[0x10];                                     // 0x0158(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool CheckSkipCurrentState();
	void DisableTimeoutCheck();
	void EnableTimeoutCheck(TDelegate<void()> OnTimeout_0);
	void GetLobbyContextParam();
	void GetRacerFinalGroupBattleResult(bool* bSuccess, struct FGroupBattleResult* OutGroupBattleResult);
	void GetResultSaveFestaResultRequest(struct FResultSaveFestaResultRequest* Request, bool* IsSuccess);
	void GetResultSaveLegendCompeResultRequest(struct FResultSaveLegendCompeResultRequest* Request, bool* IsSuccess);
	void GetResultSaveRankMatchResultRequest(struct FResultSaveRankMatchResultRequest* Request, bool* IsSuccess);
	void GetResultSaveTimeTrialResult(struct FResultSaveTimeTrialResultRequest* Request, bool* IsSuccess);
	bool IsBonusNoOneInGroup(const int32 InRacerIndex, const struct FGroupBattleResult& InGroupBattleResult);
	bool IsLeadNoOneInGroup(const int32 InRacerIndex, const struct FGroupBattleResult& InGroupBattleResult);
	bool isPlayerControlRacer(int32 InRacerIndex);
	void NextState();
	void OnPostCalcLegendCompeRating(const struct FPostCalcLegendCompeRatingParam& Param);
	void ResetAlreadyCalledDisableTimeout();
	void SetPlayerDataRelationWhenGoal();
	void SetupUserOrder();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RaceSequenceStateSendRaceEnd")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RaceSequenceStateSendRaceEnd")
	}
	static class URaceSequenceStateSendRaceEnd* GetDefaultObj()
	{
		return GetDefaultObjImpl<URaceSequenceStateSendRaceEnd>();
	}
};
DUMPER7_ASSERTS_URaceSequenceStateSendRaceEnd;

// Class UNION.AppNetFestaUtils
// 0x0000 (0x0028 - 0x0028)
class UAppNetFestaUtils final : public UBlueprintFunctionLibrary
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AppNetFestaUtils")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AppNetFestaUtils")
	}
	static class UAppNetFestaUtils* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAppNetFestaUtils>();
	}
};
DUMPER7_ASSERTS_UAppNetFestaUtils;

// Class UNION.ResultRateRankUpWindow
// 0x0080 (0x0360 - 0x02E0)
class UResultRateRankUpWindow : public UUserWidget
{
public:
	TMulticastInlineDelegate<void()>              OnRankUpWidgetInAnimationFinish;                   // 0x02E0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnRankUpWidgetOutAnimationFinish;                  // 0x02F0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnRankUpPlayVoice;                                 // 0x0300(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	TMap<ELegendCompeRateGrade, class FText>      GradeVBLabel;                                      // 0x0310(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)

public:
	void PlayInAnimation();
	void PlayOutAnimation();
	void SetupRankUpInfo(int32 PrevRank, int32 LatestRank);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ResultRateRankUpWindow")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ResultRateRankUpWindow")
	}
	static class UResultRateRankUpWindow* GetDefaultObj()
	{
		return GetDefaultObjImpl<UResultRateRankUpWindow>();
	}
};
DUMPER7_ASSERTS_UResultRateRankUpWindow;

// Class UNION.AppNetWirelessUtils
// 0x0000 (0x0028 - 0x0028)
class UAppNetWirelessUtils final : public UBlueprintFunctionLibrary
{
public:
	static bool ConvertJoinInfoToSessionInfo(const class UObject* WorldContextObject, const class ULobbyJoinInfo* JoinInfo, struct FWirelessSearchSessionInfo* OutSessionInfo);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AppNetWirelessUtils")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AppNetWirelessUtils")
	}
	static class UAppNetWirelessUtils* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAppNetWirelessUtils>();
	}
};
DUMPER7_ASSERTS_UAppNetWirelessUtils;

// Class UNION.CheatSanitizer
// 0x0000 (0x0028 - 0x0028)
class UCheatSanitizer final : public UObject
{
public:
	void DebugSanitize(const class FString& CheckWord);
	void DebugSanitizeArray(const class FString& CheckWord, int32 RequestCount);
	void SetDebugSanitizerFail(bool DebugSanitizerFail);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CheatSanitizer")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CheatSanitizer")
	}
	static class UCheatSanitizer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCheatSanitizer>();
	}
};
DUMPER7_ASSERTS_UCheatSanitizer;

// Class UNION.RankingLineScroller
// 0x0060 (0x0388 - 0x0328)
class URankingLineScroller : public UUnionUIInputWidget
{
public:
	int32                                         LastItemIndex;                                     // 0x0328(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_32C[0x4];                                      // 0x032C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class URankingLine*                           MyLine;                                            // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	TArray<class URankingLine*>                   Lines;                                             // 0x0338(0x0010)(BlueprintVisible, ExportObject, ZeroConstructor, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPublic, TObjectPtr)
	class UScrollBox*                             ScrollBox_0;                                       // 0x0348(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	EGameModeId                                   GameModeID;                                        // 0x0350(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_351[0x7];                                      // 0x0351(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUnionRichTextBlock*                    TXT_MyDetaDay;                                     // 0x0358(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	class UUnionRichTextBlock*                    TXT_OtherDetaDay;                                  // 0x0360(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	TSubclassOf<class URankingLine>               ItemClass;                                         // 0x0368(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_370[0x8];                                      // 0x0370(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FMenuRankingLineData>           RankingDataList;                                   // 0x0378(0x0010)(BlueprintVisible, ZeroConstructor, Protected, NativeAccessSpecifierProtected)

public:
	void AddItem(const struct FMenuRankingLineData& RankingLineData);
	void ClearLines();
	void ConvertMyRankingDataTimeTrialToRankingLine(EAppSupportedPlatform Platform, const struct FMyRankingData& RankingData, struct FMenuRankingLineData* OutLineData);
	void ConvertRankingDataFestaPointToRankingLine(const struct FRankingDataFestaPoint& RankingData, struct FMenuRankingLineData* OutLineData);
	void ConvertRankingDataFestaToRankingList(const struct FRankingDataFestaPointList& RankingData);
	void ConvertRankingDataLegendCompeToRankingLine(const struct FRankingDataLegendCompe& RankingData, struct FMenuRankingLineData* OutLineData);
	void ConvertRankingDataLegendCompeToRankingList(const struct FRankingDataLegendCompeList& RankingData);
	void ConvertRankingDataRankMatchToRankingLine(const struct FRankingDataRankMatch& RankingData, struct FMenuRankingLineData* OutLineData);
	void ConvertRankingDataRankMatchToRankingList(const struct FRankingDataRankMatchList& RankingData);
	void ConvertRankingDataTimeTrialToRankingLine(const struct FRankingDataTimeTrial& RankingData, struct FMenuRankingLineData* OutLineData);
	void ConvertRankingDataTimeTrialToRankingList(const struct FRankingDataTimeTrialList& RankingData);
	bool GetIsFocusingFirstLine();
	bool GetIsFocusingLastLine();
	void InitializeHover();
	void MouseClickEvent();
	void SetGameMode(EGameModeId InGameMode);
	void SetMyRankDateDateTime(const struct FDateTime& DateTime);
	void SetMyRankDateString(const class FString& DateString);
	void SetRankDateDateTime(const struct FDateTime& DateTime);
	void SetRankDateString(const class FString& DateString);
	void SetRankDateVisibility(bool IsVisible_0);
	void UpdateHover();
	void UpdateItems();
	void UpdateMyLine(const struct FMenuRankingLineData& RankingLineData);
	void UpdateVisibility(int32 InIndex, ESlateVisibility InVisibility);

	int32 GetCurrentIndex() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RankingLineScroller")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RankingLineScroller")
	}
