#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Result_Sub_RankingTable_GP_Line

#include "Basic.hpp"

#include "UnionSystem_structs.hpp"
#include "UNION_structs.hpp"
#include "Engine_structs.hpp"
#include "UnionRun_classes.hpp"
#include "UMG_structs.hpp"
#include "UnionLib_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Result_Sub_RankingTable_GP_Line.WBP_Result_Sub_RankingTable_GP_Line_C
// 0x0138 (0x05A8 - 0x0470)
class UWBP_Result_Sub_RankingTable_GP_Line_C final : public UUnionRaceUIResultPanel
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0470(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Result_GP_Bonus_Loop;                              // 0x0478(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Result_GP_TotalPoint_AddMove;                      // 0x0480(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Result_GP_TotalPoint_In;                           // 0x0488(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Result_GP_TotalPoint_Out;                          // 0x0490(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Result_GP_Loop;                                    // 0x0498(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Result_GP_In;                                      // 0x04A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Panel;                                             // 0x04A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_RankingTable;                          // 0x04B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CMN_Sub_SpeedClassInfo_C*          WBP_CMN_Sub_SpeedClassInfo;                        // 0x04B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Result_Sub_RankingTable_GP_02_C*   WBP_Result_Sub_RankingTable_GP_10;                 // 0x04C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Result_Sub_RankingTable_GP_02_C*   WBP_Result_Sub_RankingTable_GP_11;                 // 0x04C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Result_Sub_RankingTable_GP_02_C*   WBP_Result_Sub_RankingTable_GP_12;                 // 0x04D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Result_Sub_RankingTable_GP_02_C*   WBP_Result_Sub_RankingTable_GP_01;                 // 0x04D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Result_Sub_RankingTable_GP_02_C*   WBP_Result_Sub_RankingTable_GP_02;                 // 0x04E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Result_Sub_RankingTable_GP_02_C*   WBP_Result_Sub_RankingTable_GP_03;                 // 0x04E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Result_Sub_RankingTable_GP_02_C*   WBP_Result_Sub_RankingTable_GP_04;                 // 0x04F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Result_Sub_RankingTable_GP_02_C*   WBP_Result_Sub_RankingTable_GP_05;                 // 0x04F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Result_Sub_RankingTable_GP_02_C*   WBP_Result_Sub_RankingTable_GP_06;                 // 0x0500(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Result_Sub_RankingTable_GP_02_C*   WBP_Result_Sub_RankingTable_GP_07;                 // 0x0508(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Result_Sub_RankingTable_GP_02_C*   WBP_Result_Sub_RankingTable_GP_08;                 // 0x0510(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Result_Sub_RankingTable_GP_02_C*   WBP_Result_Sub_RankingTable_GP_09;                 // 0x0518(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         RacerCount;                                        // 0x0520(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_524[0x4];                                      // 0x0524(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        OffsetTimePerRacer;                                // 0x0528(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 RaceResultPoint;                                   // 0x0530(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	ERaceResultStats                              NowResultState;                                    // 0x0540(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_541[0x7];                                      // 0x0541(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       LastPlayAnim;                                      // 0x0548(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsEnd;                                            // 0x0550(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsRankMatchMode;                                  // 0x0551(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bEnableSkip;                                       // 0x0552(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_553[0x5];                                      // 0x0553(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              PanelDebugTexture;                                 // 0x0558(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              AddCloseRewardEvent;                               // 0x0580(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UWBP_Result_DonpaTicket_C*              ResultDonpaTicket;                                 // 0x0590(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UHintPopupWindow*                       TipsWindow;                                        // 0x0598(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EHintId                                       FirstDonpaTicketTipsID;                            // 0x05A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AddBonus();
	void AddPoint();
	void CalcVisibleByRacerCount_Impl();
	void Construct();
	void CreateTipsWindow(EHintId InHintId);
	void DebugRandomArrow();
	void DebugValueStart();
	void DelayStartAnim(class UWidgetAnimation* Animation);
	void DelayStartResult_GP_TotalPoint_In();
	void EnterExitIdle();
	void ExecuteUbergraph_WBP_Result_Sub_RankingTable_GP_Line(int32 EntryPoint);
	void ExitOutAnimationFinish();
	void ExitProc();
	void Finished_26DDDFEF4AA047C3BAFC0586FBA709B6();
	void Finished_9BF783D74A7E7515B77DB4BB8915144B();
	void GetChanceUpOrderValue(int32* OutOrderValue);
	void InitRankIndexLine();
	void IsTipsState(bool* Result);
	void NextLodingView();
	void OnAddMoveFinished();
	void OnAnimEvent_AddedPoint_Event();
	void OnFinishedAnimation();
	void OnInitialized();
	void OnSkipNext();
	void OnTipsSaveComplete(ESaveDataStatus Status);
	void OnTipsWindowCloseEnd_Event();
	void Play1stOutAnimByRacerCount_Impl();
	void PlayAddMoveAnim_Impl();
	void PlayBonus();
	void PlayBonusLoop();
	void PlayCloseAnim();
	void PlayInAnim_Impl();
	void PlayInResultDonpaTicket();
	void PlayLoadingAnim();
	void PlayResultLoop();
	void PlayTotalInAnim_Impl();
	void PlayTotalInAnimForResult();
	void PlayTotalViewLoop();
	void PreConstruct(bool IsDesignTime);
	void SequenceEvent__ENTRYPOINTWBP_Result_Sub_RankingTable_GP_Line(class UWBP_Result_Sub_RankingTable_GP_02_C* WBP_Result_Sub_RankingTable_GP_12_0);
	void SequenceEvent__ENTRYPOINTWBP_Result_Sub_RankingTable_GP_Line_0(class UWBP_Result_Sub_RankingTable_GP_02_C* WBP_Result_Sub_RankingTable_GP_11_0);
	void SequenceEvent__ENTRYPOINTWBP_Result_Sub_RankingTable_GP_Line_1(class UWBP_Result_Sub_RankingTable_GP_02_C* WBP_Result_Sub_RankingTable_GP_10_0);
	void SequenceEvent__ENTRYPOINTWBP_Result_Sub_RankingTable_GP_Line_10(class UWBP_Result_Sub_RankingTable_GP_02_C* WBP_Result_Sub_RankingTable_GP_01_0);
	void SequenceEvent__ENTRYPOINTWBP_Result_Sub_RankingTable_GP_Line_2(class UWBP_Result_Sub_RankingTable_GP_02_C* WBP_Result_Sub_RankingTable_GP_09_0);
	void SequenceEvent__ENTRYPOINTWBP_Result_Sub_RankingTable_GP_Line_3(class UWBP_Result_Sub_RankingTable_GP_02_C* WBP_Result_Sub_RankingTable_GP_08_0);
	void SequenceEvent__ENTRYPOINTWBP_Result_Sub_RankingTable_GP_Line_4(class UWBP_Result_Sub_RankingTable_GP_02_C* WBP_Result_Sub_RankingTable_GP_07_0);
	void SequenceEvent__ENTRYPOINTWBP_Result_Sub_RankingTable_GP_Line_5(class UWBP_Result_Sub_RankingTable_GP_02_C* WBP_Result_Sub_RankingTable_GP_06_0);
	void SequenceEvent__ENTRYPOINTWBP_Result_Sub_RankingTable_GP_Line_6(class UWBP_Result_Sub_RankingTable_GP_02_C* WBP_Result_Sub_RankingTable_GP_05_0);
	void SequenceEvent__ENTRYPOINTWBP_Result_Sub_RankingTable_GP_Line_7(class UWBP_Result_Sub_RankingTable_GP_02_C* WBP_Result_Sub_RankingTable_GP_04_0);
	void SequenceEvent__ENTRYPOINTWBP_Result_Sub_RankingTable_GP_Line_8(class UWBP_Result_Sub_RankingTable_GP_02_C* WBP_Result_Sub_RankingTable_GP_03_0);
	void SequenceEvent__ENTRYPOINTWBP_Result_Sub_RankingTable_GP_Line_9(class UWBP_Result_Sub_RankingTable_GP_02_C* WBP_Result_Sub_RankingTable_GP_02_0);
	void SetRacerCount_Impl(int32 RacerCount_0);
	void SetResultStats(ERaceResultStats ResultStats);
	void SetSpeedClassUIVisible(bool bVisible);
	void StartLodingView();
	void WBP_Result_Sub_RankingTable_GP_01_Event_0(class UWBP_Result_Sub_RankingTable_GP_02_C* WBP_Result_Sub_RankingTable_GP_01_0);
	void WBP_Result_Sub_RankingTable_GP_02_Event_0(class UWBP_Result_Sub_RankingTable_GP_02_C* WBP_Result_Sub_RankingTable_GP_02_0);
	void WBP_Result_Sub_RankingTable_GP_03_Event_0(class UWBP_Result_Sub_RankingTable_GP_02_C* WBP_Result_Sub_RankingTable_GP_03_0);
	void WBP_Result_Sub_RankingTable_GP_04_Event_0(class UWBP_Result_Sub_RankingTable_GP_02_C* WBP_Result_Sub_RankingTable_GP_04_0);
	void WBP_Result_Sub_RankingTable_GP_05_Event_0(class UWBP_Result_Sub_RankingTable_GP_02_C* WBP_Result_Sub_RankingTable_GP_05_0);
	void WBP_Result_Sub_RankingTable_GP_06_Event_0(class UWBP_Result_Sub_RankingTable_GP_02_C* WBP_Result_Sub_RankingTable_GP_06_0);
	void WBP_Result_Sub_RankingTable_GP_07_Event_0(class UWBP_Result_Sub_RankingTable_GP_02_C* WBP_Result_Sub_RankingTable_GP_07_0);
	void WBP_Result_Sub_RankingTable_GP_08_Event_0(class UWBP_Result_Sub_RankingTable_GP_02_C* WBP_Result_Sub_RankingTable_GP_08_0);
	void WBP_Result_Sub_RankingTable_GP_09_Event_0(class UWBP_Result_Sub_RankingTable_GP_02_C* WBP_Result_Sub_RankingTable_GP_09_0);
	void WBP_Result_Sub_RankingTable_GP_10_Event_0(class UWBP_Result_Sub_RankingTable_GP_02_C* WBP_Result_Sub_RankingTable_GP_10_0);
	void WBP_Result_Sub_RankingTable_GP_11_Event_0(class UWBP_Result_Sub_RankingTable_GP_02_C* WBP_Result_Sub_RankingTable_GP_11_0);
	void WBP_Result_Sub_RankingTable_GP_12_Event_0(class UWBP_Result_Sub_RankingTable_GP_02_C* WBP_Result_Sub_RankingTable_GP_12_0);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_Result_Sub_RankingTable_GP_Line_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_Result_Sub_RankingTable_GP_Line_C")
	}
	static class UWBP_Result_Sub_RankingTable_GP_Line_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Result_Sub_RankingTable_GP_Line_C>();
	}
};
DUMPER7_ASSERTS_UWBP_Result_Sub_RankingTable_GP_Line_C;

}

