#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Race_HUD_Sub_BasicOperation

#include "Basic.hpp"

#include "UnionSystem_structs.hpp"
#include "Engine_structs.hpp"
#include "UnionRun_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Race_HUD_Sub_BasicOperation.WBP_Race_HUD_Sub_BasicOperation_C
// 0x0040 (0x0320 - 0x02E0)
class UWBP_Race_HUD_Sub_BasicOperation_C final : public URaceUISubBasicOperation
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Operation_Out;                                     // 0x02E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Operation_InLoop;                                  // 0x02F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWBP_Race_HUD_Sub_BasicOperationHeader_C* WBP_Race_HUD_Sub_BasicOperationHeader;           // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Tutorial_Controller_Wrapper_C*     WBP_Tutorial_Controller_Wrapper;                   // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bIsVisible;                                        // 0x0308(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETutorialAction                               CurrentTutorialAction;                             // 0x0309(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bSuccess;                                          // 0x030A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30B[0x5];                                      // 0x030B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<ETutorialAction>                       SuccessedTutorialActions;                          // 0x0310(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void Construct();
	void DispOffRaceActionTutorial();
	void DispOnRaceActionTutorial(ETutorialAction tutorialAction);
	void ExecuteUbergraph_WBP_Race_HUD_Sub_BasicOperation(int32 EntryPoint);
	void Finished_6E0CC0EF460463F1B44ACAA80AD622CD();
	void Finished_799657174D456726694EF29A942D489A();
	void GetTextByRaceAction(ETutorialAction RaceActionTutorial, class FText* Text);
	void RaceActionTutorialSuccess(ETutorialAction TutorialActon);
	void SetControllerVisibility(bool bVisible);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_Race_HUD_Sub_BasicOperation_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_Race_HUD_Sub_BasicOperation_C")
	}
	static class UWBP_Race_HUD_Sub_BasicOperation_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Race_HUD_Sub_BasicOperation_C>();
	}
};
DUMPER7_ASSERTS_UWBP_Race_HUD_Sub_BasicOperation_C;

}

